# Необходимо написать проект, содержащий функционал работы с заметками.
# Программа должна уметь:
# - создавать заметку
# - сохранять её
# - читать список заметок
# - редактировать заметку
# - удалять заметку
# - показать содержимое заметки
# - делать выборку по дате
# - 
# Заметка должна содержать:
# - идентификатор
# - заголовок
# - тело заметки
# - дату/время создания или последнего изменения заметки 
# Сохранение заметок необходимо сделать в формате json или csv формат (разделение полей рекомендуется делать через точку с запятой)



